of90/tutorials/rheoEFoam/EKmixer/slipSmoluchowski/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|phiE|psi)"
    {
        solver          GAMG;
        tolerance       1e-8;
        relTol          0.;
        smoother        DIC;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        
    }
    
    "(C|U)"
    {
        solver           PBiCGStab;
        preconditioner
        {
            preconditioner DILU;
        }

        tolerance         1e-8;
        relTol            0.;
        minIter           0;
        maxIter           1000;       
    }
}

electricControls
{
  phiEEqn
   {
      residuals 1e-7;
      maxIter      1;
   }

  psiEqn
   {
      residuals 1e-7;
      maxIter      1;
   }
}

SIMPLE
{
    nInIter         1;
    nNonOrthogonalCorrectors 2;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
       
    }
}
 

relaxationFactors
{
   
}

// ************************************************************************* //
